Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-38-42.tmx
Source language: bo
Languages: en

source: །ཕྱོགས་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་རྒྱས་པར་དགའ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་མཐའི་སྤྱོད་པ་རྒྱ་མཚོ་ཚད་མེད་པ་ལ་འཇུག་པའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་ཚད་མེད་པའི་ཡེ་ཤེས་སྣང་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་དཀའ་བ་ཚད་མེད་པ་ཡོངས་སུ་གཏོང་བའི་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་དཀྱིལ་འཁོར་ཚད་མེད་པ་ཡོངས་སུ་དག་པ་སྣང་བར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་བཟོད་པའི་ཚད་མེད་པ་ཡོངས་སུ་སྦྱོང་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་བརྩོན་འགྲུས་ཆེན་པོའི་ཤུགས་ཚད་མེད་པ་རྣམ་པར་འཕེལ་བར་བྱ་བའི་མཐུའི་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་བསམ་གཏན་གྱི་དཀྱིལ་འཁོར་དང་། བསམ་གཏན་གྱི་ཡན་ལག་རྒྱ་མཚོ་ཚད་མེད་པ་ཡོངས་སུ་དག་པར་བྱ་བའི་སྦྱོར་བས་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་རྒྱ་མཚོ་ཚད་མེད་པ་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། རྣམ་པར་དམིགས་པ་སྣང་བར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་ཐབས་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་རྒྱ་མཚོ་ཚད་མེད་པ་ལ་འཇུག་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་རྒྱ་མཚོ་ཚད་མེད་པ་ལ་འཇུག་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་བསོད་ནམས་དང་། ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཚད་མེད་པ་ལ་གནས་པར་བྱ་བ་དང་། ཡོངས་སུ་འཕེལ་བར་བྱ་བའི་ཡེ་ཤེས་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་རྒྱ་མཚོ་ཚད་མེད་པ་ལ་རྣམ་པར་སྤྱད་པ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཡེ་ཤེས་ཡོངས་སུ་བསྒྲུབ་པའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་གནོན་པར་མཛད་པའི་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་ས་ཡོངས་སུ་གནོན་པའི་མཚམས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཚད་མེད་པས་བསྐལ་པ་རྒྱ་མཚོ་གནས་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་སའི་དཀྱིལ་འཁོར་ཚད་མེད་པ་ཡོངས་སུ་གནོན་པའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་ས་ཚད་མེད་པ་ལ་གནས་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་ས་ཚད་མེད་པ་ཡོངས་སུ་དག་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་ས་ཚད་མེད་པ་ཡེ་ཤེས་རྒྱ་མཚོས་རྣམ་པར་དཔྱད་པའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་སའི་ཡེ་ཤེས་སྣང་བ་ཚད་མེད་པ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པས་སྔོན་གྱི་སངས་རྒྱས་མ་ལུས་པར་གཟིགས་པ་དང་། རྗེས་སུ་འབྲང་བར་མཛད་པ་ཚད་མེད་པ་རྣམ་པར་དམིགས་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པས་སྔོན་གྱི་སངས་རྒྱས་རྒྱ་མཚོ་མ་ལུས་པར་གཟིགས་ཤིང་བསྐལ་པ་རྒྱ་མཚོར་བཞུགས་བཞུགས་པ་ཚད་མེད་པའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པ་སྔོན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པས་ཞིང་རྒྱ་མཚོ་མ་ལུས་པར་རྒྱས་པར་དགང་བའི་སྐུ་མངོན་པར་བསྒྲུབ་པ་ཚད་མེད་པའི་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཚད་མེད་པས་ཆོས་ཀྱི་དབྱིངས་མ་ལུས་པ་རྒྱས་པར་དགང་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐབས་སྣ་ཚོགས་ཀྱི་སྒོ་དང་ལྡན་པས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་མཛད་པ་དང་། རྣམ་པར་གདུལ་བ་མཛད་པ་ཚད་མེད་པ་ཡོངས་སུ་བསྟན་པའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་འོད་ཕྱོགས་རྒྱ་མཚོ་མ་ལུས་པ་ཐམས་ཅད་ཏུ་རབ་ཏུ་འཕྲོ་བ་ཚད་མེད་པས་རྒྱས་པར་དགང་བར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་དུ་གྱུར་པ་རྣམ་པར་འཕྲུལ་པ་ཚད་མེད་པ་ཡོངས་ས་བསྟན་པའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱིས་ཚད་མེད་པ་ཡོངས་སུ་གནོན་པའི་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པའི་རྣམ་པར་འཕྲུལ་པ་ཚད་མེད་པའི་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའ་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་འཁོར་བ་དང་། ཆོས་ཀྱི་སྤྲིན་ཚད་མེད་པ་ཐམས་ཅད་མ་ལུས་པར་ཡང་དག་པར་བླང་ཞིང་ཡོངས་སུ་གཟུང་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་མཚན་རྒྱ་མཚོ་ཚད་མེད་པར་རྣམ་པར་དམིགས་པའི་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་རྒྱ་མཚོའི་རྒྱུད་ཚད་མེད་པ་རྣམ་པར་དམིགས་པ་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཚུལ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡུལ་ཤིན་ཏུ་ཡངས་པའི་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཚུལ་གྱིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཐོག་མ་ཐུགས་བསྐྱེད་པ་ནས།
en: through the illuminating perception of the purification by the tathāgatas of the immeasurable ocean of the perfection of wisdom; through comprehending the immeasurable ocean of the ways of the tathāgatas in the perfection of skillful methods; through comprehending the immeasurable ocean of the ways of the tathāgatas in the perfection of prayers; through having attained the knowledge of the tathāgatas remaining in and increasing the immeasurable perfection of the power of merit and wisdom; through having attained the knowledge of the ways of practice by the tathāgatas in the immeasurable ocean of the perfection of knowledge; through having attained the illuminating knowledge of the tathāgatas in the past ascending immeasurable bodhisattva bhūmis; through being present in an ocean of kalpas of immeasurable miraculous manifestations by the tathāgatas on ascending the bhūmis; through the past ascent by the tathāgatas through the immeasurable domain of the bodhisattva bhūmis; through the past dwelling by the tathāgatas in immeasurable bodhisattva bhūmis; through the past purification by the tathāgatas of immeasurable bodhisattva bhūmis; through contemplating the ocean of knowledge of the immeasurable bhūmis of the tathāgatas; through having attained the illuminating knowledge of immeasurable tathāgatas; through perceiving the immeasurable seeing and following of every past buddha by the tathāgatas when they were bodhisattvas; through perceiving the immeasurable repeated presence of the tathāgatas, when they were bodhisattvas, in an ocean of kalpas, and seeing the entire ocean of all the buddhas in the past; through having attained the illuminating knowledge of the tathāgatas as bodhisattvas having the immeasurable accomplishment of their bodies pervading the entire ocean of realms; through the immeasurable, vast bodhisattva conduct of the tathāgatas pervading the entire realm of phenomena; through the vision of the past immeasurable bodhisattva conduct by the tathāgatas of ripening and guiding all beings through various methods; through the immeasurable radiating light of the tathāgatas pervading the entire ocean of directions; through the tathāgatas’ immeasurable display of miraculous manifestations directly to beings; through having attained the illuminating knowledge of the ascent to the immeasurable level of the knowledge of the tathāgatas; through having attained the illuminating knowledge of the immeasurable miraculous manifestation of the attainment of buddhahood by the tathāgatas;

source: དམ་པའི་ཆོས་ནུབ་པར་མ་གྱུར་པའི་བར་དེ་དག་ཐམས་ཅད་ལ་ཡང་འཇུག་ཅིང་ཁོང་དུ་ཆུད་པར་བྱེད་དོ།
en: through having obtained and possessed the entirety of all the immeasurable clouds of Dharma from the turnings of the wheel of the Dharma by the tathāgatas; through having attained the illuminating knowledge that perceives the immeasurable ocean of the characteristics of the tathāgatas; through having attained the illuminating knowledge that perceives the immeasurable ocean of the activities of the bodies of the tathāgatas; and through having attained the illuminating knowledge of the immeasurable, vast scope of the tathāgatas.

source: །དེ་སྐད་དུ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དགའ་བ་ཡངས་པའི་ཤུགས་འབྱུང་བས་སེམས་ཀྱི་སྐད་ཅིག་རྣམ་པར་བརྒྱན་པ་འདི་ཐོབ་ནས་ཇི་སྲིད་ཅིག་ལོན་ཞེས་ཟེར་བ་ནི།
en: “You ask me how long it has been since I attained this bodhisattva liberation called the display in each instant of mind of the arising of the power of vast delight ? It was like this:

source: དེ་ལྟར་ཁོ་མོས་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་གཉིས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཕ་རོལ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་གསེར་ལྟར་དྲི་མ་མེད་པའི་འོད་དུ་བྱང་ཆུབ་ཀྱི་ཤིང་གི་ལྷ་མོ་བསོད་ནམས་སྒྲོན་མ་ཕུན་སུམ་ཚོགས་པ་ཀུན་ནས་དཔལ་གྱི་འོད་ཅེས་བྱ་བར་གྱུར་ཏེ།
en: As many kalpas ago as there are atoms in two buddha realms, in the world realm called Kanaka­vimala­prabhā, I was a Bodhi-tree goddess by the name of Puṇya­pradīpa­saṃpatsamanta­ketu­prabhā.

source: དེ་བཞིན་གཤེགས་པ་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་དབྱངས་ཀྱིས་ཆོས་བསྟན་པ་ཐོས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: When I heard the Dharma taught by the Tathāgata Avivartya­dharma­dhātu­nirghoṣa, I developed that aspiration to attain the highest, complete enlightenment.

source: བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་གཉིས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་པོ་དེ་དག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་ན། མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་སྐྱེས་ཏེ།
en: I practiced bodhisattva conduct for as many kalpas as there are atoms in two buddha realms and was then reborn in this world realm called Sahā.

source: ལོག་པར་དད་སེལ་ལ་སྩོགས་པ་ཐ་མ་ཤཱཀྱ་ཐུབ་པའི་བར་གྱི་དེ་བཞིན་གཤེགས་པ་བསྐལ་པ་བཟང་པོ་པ་དག་ཀྱང་བསྙེན་བཀུར་ཏོ། །མ་བྱོན་པའི་སངས་རྒྱས་རྣམས་ཀྱང་བསྙེན་བཀུར་རོ།
en: I venerated the tathāgatas of the Bhadra kalpa, from Krakucchanda to Śākyamuni, and I will also venerate its future buddhas.

source: །འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཇི་ལྟ་བ་དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུའང་སངས་རྒྱས་ཀྱི་རྒྱུད་མ་བྱོན་པ་རྣམས་ཡོངས་སུ་བསྙེན་ཅིང་བཀུར་རོ། །མཆོད་དོ།
en: And just as in this world realm, I will venerate and make offerings to the future succession of buddhas in all world realms.

source: །རིགས་ཀྱི་བུ་ད་དུང་དུའང་འཇིག་རྟེན་གྱི་ཁམས་གསེར་ལྟར་དྲི་མ་མེད་པའི་འོད་དེ་ཡང་ཡོད་ལ་སངས་རྒྱས་ཀྱི་རིགས་ཀྱང་རྒྱུན་མ་ཆད་ཀྱིས།
en: “Noble one, there continues even now to be a succession of buddhas in the world realm Kanaka­vimala­prabhā.

source: དེ་བས་ན་རིགས་ཀྱི་བུ་ཚུལ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་གནོན་པ་ཆེན་པོས་བརྩོན་པར་གྱིས་ཤིག །དེ་ནས་མཚན་མོའི་ལྷ་མོ་སྒྲ་རྒྱ་མཚོ་རབ་ཏུ་ཞི་བ་དང་ལྡན་པས།
en: “Therefore, noble one, you should dedicate yourself to this way with the fortitude of the bodhisattva.”

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དགའ་བ་ཡངས་པའི་ཤུགས་འབྱུང་བས་སེམས་ཀྱི་སྐད་ཅིག་རྣམ་པར་བརྒྱན་པ་འདི་ཉིད་བརྣན་ཏེ་བསྟན་པར་བྱ་བའི་ཕྱིར། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: At that time, the night goddess Praśanta­ruta­sāgara­vatī, in order to teach further the bodhisattva liberation called the display in each instant of mind of the arising of the power of vast delight , recited these verses to Sudhana, the head merchant’s son: “Listen, Sudhana, to these words of mine

source: རྣམ་ཐར་དགེ་འདི་ཇི་ལྟར་ཐོབ་འགྱུར་བ།
en: About how I obtained this good liberation.

source: །ཁོ་མོའི་ཚིག་འདི་ནོར་བཟངས་ཁྱོད་ཉོན་ཅིག །ཐོས་ནས་དགའ་བའི་སྟོབས་ཀྱང་ཡོངས་སྐྱེད་དེ།
en: Hearing them will give rise to great delight,

source: །རྣམ་ཐར་ཚུལ་འདི་ལ་ནི་འཇུག་པར་གྱིས།
en: And you must comprehend this liberation.

source: །བདག་གི་སེམས་དང་བསམ་པ་ཡོངས་སྦྱོང་ཞིང་།
en: “I purified my mind and my thoughts,

source: །མོས་པའི་ཤུགས་ཡངས་ཡོངས་སུ་སྐྱེད་བྱས་ཏེ །ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་གྲོང་འདུན་པས།
en: And I developed a vast, powerful aspiration. Intent on the city of omniscient wisdom,

source: །བསྐལ་པ་རྒྱ་མཚོ་མང་པོར་སྔོན་སྤྱད་དོ།
en: I practiced for many oceans of past kalpas.

source: །བདེ་གཤེགས་དུས་གསུམ་བྱུང་བ་ཐོས་ནས་ཀྱང་།
en: “I listened to the sugatas in the three times

source: །དེ་དག་ཀུན་ལ་མོས་བ་ཡངས་བསྐྱེད་དོ།
en: And developed an aspiration toward them all.

source: །བསྐལ་པ་བརྒྱ་ཕྲག་མང་པོར་སྒོ་ཀུན་ཏུ།
en: Through the passage of many hundreds of kalpas,

source: །དེ་དག་འཁོར་དང་བཅས་པར་ཁོ་མོས་བཀུར།
en: I attended on them and their assemblies.

source: །སྔོན་གྱི་བདེ་གཤེགས་ཁོ་མོས་མཐོང་གྱུར་ནས།
en: “I saw the sugatas of the past and made offerings to them

source: །འགྲོ་ལ་ཕན་ཕྱིར་ཡུན་རིང་མཆོད་བྱས་ཏེ།
en: Over a long time, so as to bring benefit to beings.

source: །སྤྲོ་བའི་སྟོབས་ནི་རྣམ་ཡངས་ཡོངས་བསྐྱེད་ནས།
en: Having developed a powerful enthusiasm,

source: །བདག་གིས་གདུང་བ་མེད་པའི་ཆོས་ཀྱང་ཐོས།
en: I listened to their Dharma without weariness.

source: །རྣམ་པར་ཐར་པ་འདི་ལ་འཇུག་པ་ན།
en: “On following the way of this liberation, I continually and respectfully attended

source: ཕ་དང་མ་དང་བླ་མའི་སྐྱེ་བོ་ལ།
en: Those who were my father, mother, and guru, Venerating them and bringing them happiness and benefit. “Through hundreds of lifetimes and with a loving mind,

source: །དེ་ཚེ་བདག་གིས་ཕན་བདེས་བསྟི་སྟང་བྱས། །བསྙེན་བཀུར་སྲི་ཞུར་གནས་པ་ཀུན་ཀྱང་བྱས།
en: I was a wealthy protector who brought happiness

source: །རྒས་པ་ནད་པ་ནོར་མེད་མི་རྣམས་དང་། །དབང་པོ་མ་ཚང་སྡུག་བསྔལ་མགོན་མེད་པ། །མང་པོ་བདག་གིས་བྱམས་སེམས་བདེ་བཀོད་ནས།
en: To many people who were old, who were sick, and who were poor, Who had impaired faculties, were in suffering, and had no protector.

source: །ཚེ་རབས་བརྒྱར་ཡང་ནོར་ཕྱུག་མགོན་ཡང་བྱས།
en: “During my bodhisattva conduct in past lives,

source: །རྒྱལ་པོ་མྱེ་དང་རྐུན་ཆོམ་རྐྱེན་གྱུར་དང་། །སེང་གེ་གླང་པོ་ཕ་རོལ་དགྲས་འཇིགས་དང་། །སྲིད་པའི་རྒྱ་མཚོའི་འཇིགས་དངོས་སྣ་ཚོགས་ལས།
en: I saved beings from an ocean of various dangers Caused by kings, fire, and bandits And by lions, elephants, and enemies.

source: །སྔོན་ཚེ་སྤྱོད་པའི་དུས་ན་བདག་གིས་བསྐྱབས།
en: “During my bodhisattva conduct in past lives,

source: །རྟག་ཏུ་སྲིད་གསུམ་ཉོན་མོངས་གདུངས་གྱུར་ཏེ།
en: I saved beings afflicted by kleśas in the three realms From the various terrors of the ocean of existence

source: །ལས་ཀྱིས་རབ་གདུངས་དེ་བཞིན་མི་དགེ་བས།
en: That arise through their bad actions. “I protected those classes of beings

source: །འཁོར་བའི་རི་གཟར་གཡང་དུ་ལྷུང་བ་ཡི། །སྐྱེ་བོ་འགྲོ་བའི་རྒྱུད་དུ་བདག་གིས་བསྐྱབས།
en: Who have fallen into the abyss of saṃsāra,

source: །སྡུག་བསྔལ་ངན་སོང་གཡང་སས་འཇིགས་པ་དག །རྟག་ཏུ་མི་བདེ་ཤིན་ཏུ་མི་ཟད་དང་། །སྐྱེ་རྒ་ན་ཞིང་འཆི་བའི་འཇིགས་མང་ཀུན།
en: Terrified by the sufferings of the lower realms, Which are always overwhelmingly dreadful.

source: །བདག་གིས་འཇིག་རྟེན་སྤྱོད་ཚེ་ཞི་བར་བྱས།
en: As I practiced bodhisattva conduct in the world, I ended the terrors of birth, old age, sickness, and death. “My prayer is that until the last kalpa

source: །འཁོར་བའི་སྡུག་བསྔལ་ཞི་བར་བྱ་བ་དང་། །སེམས་ཅན་ཀུན་གྱི་བདེ་བ་ཡོངས་བསྐྱེད་ཅིང་།
en: I will bring an end to the suffering of saṃsāra; I will bring happiness to all beings

source: །སངས་རྒྱས་བདེ་བ་དམ་པ་བསྐྱེད་པ་ནི། །བསྐལ་པ་ཕྱི་མཐར་ཁོ་མོའི་སྨོན་ལམ་མོ།
en: And give rise to the ultimate happiness of buddhahood.

source: །རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དགའ་བ་ཡངས་པའི་ཤུགས་འབྱུང་བས་སེམས་ཀྱི་སྐད་ཅིག་རྣམ་པར་བརྒྱན་པ་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only this bodhisattva liberation called the display in each instant of mind of the arising of the power of vast delight

source: ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་ཞུགས་པ་ཕྱི་ནང་གི་སྡུག་བསྔལ་མ་ལུས་པ་ལས་རྣམ་པར་གྲོལ་བ། བསྐལ་པའི་མིང་དུ་བྱ་བ་ཐམས་ཅད་ཤེས་པར་གྱུར་པ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་འབྱུང་བ་དང་། འཇིག་པའི་རྒྱུས་ལ་མཁས་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ་ཡོན་ཏན་བརྗོད་པ་ནུས་རེ་སྐན།
en: How could I know the conduct or describe the qualities of bodhisattvas who have comprehend the entire realm of phenomena, who are liberated from every outer and inner suffering, who know the names of all kalpas, who are wise in the creation of the ocean of all worlds and their destruction? “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་སྙིང་པོ་བྱང་ཆུབ་འདི་ཉིད་ན་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ན། མཚན་མོའི་ལྷ་མོ་གྲོང་ཁྱེར་ཐམས་ཅད་བསྲུང་བ་འབྱུང་བའི་གཟི་བརྗིད་དཔལ་ཞེས་བྱ་བ་འདུག་གིས།
en: Here in this very bodhimaṇḍa, within the assembly of the Bhagavat Vairocana, there is the goddess of the night who has the name Sarva­nagara­rakṣā­saṃbhava­tejaḥ­śrī.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་སྒྲ་རྒྱ་མཚོ་རབ་ཏུ་ཞི་བ་དང་ལྡན་པ་ལ་ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: Go to her and ask her, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’ ” Then Sudhana, the head merchant’s son, recited these appropriate verses to the night goddess Praśanta­ruta­sāgara­vatī:

source: །དགེ་བའི་བཤེས་ཀྱིས་མ་ནོར་མཐུན་བསྟན་པས།
en: “The kalyāṇamitra instructed me correctly,

source: །ལྷ་མོ་ཁྱོད་ཀྱི་དྲུང་དུ་ཉེ་བར་མཆིས།
en: And therefore I came into your presence, goddess. I saw you seated upon your throne

source: །མཐའ་དང་དབུས་མི་མངའ་བའི་སྐུ་ཚུལ་དུ།
en: With a body that knows no limit or center.

source: །ཁྱོད་ནི་གདན་ལ་བཞུགས་པར་བདག་གིས་མཐོང་།
en: “Those who rely on existence and believe things to be real,

source: །ཁ་དོག་དབྱིབས་དང་མཚན་མའི་སྤྱོད་ཡུལ་བ།
en: Whose fields of perception are colors, shapes, and characteristics,

source: །སྲིད་ལ་གནས་དང་དངོས་པོར་འདུ་ཤེས་དང་། །འདུ་ཤེས་དམའ་དང་ལོག་པར་ལྟ་བ་ཡིས།
en: Inferior beings who hold wrong views,

source: །ཁྱོད་ཀྱི་སྤྱོད་ཡུལ་འཚལ་བར་མི་ནུས་སོ།
en: Cannot know this field of activity of yours.

source: །ཁྱོད་ཀྱི་སྐུ་གཟུགས་བལྟ་ན་མཐའ་ཡས་པས།
en: “The vision of your body is infinite. The world and its devas could not know

source: །ཁྱོད་ཀྱི་སྐུ་གཟུགས་མདོག་གི་མཚན་མ་ནི།
en: The characteristics of your form and color

source: །བསྐལ་པ་མཐའ་ཡས་དག་ཏུ་ཡོངས་བརྟགས་ཀྱང་། །ལྷ་དང་འཇིག་རྟེན་བཅས་པས་ཤེས་མི་ནུས།
en: Even by examining them for endless kalpas.

source: །ལྷ་མོ་ཁྱོད་ནི་ཕུང་པོའི་གནས་ལས་འཕགས།
en: “Goddess, you are above the basis of the skandhas

source: །སྐྱེ་མཆེད་རྣམས་ལའངདེ་བཞིན་མི་གནས་ཏེ།
en: You are not located within the āyatanas.

source: །འཇིག་རྟེན་རྣམ་པར་འདས་པས་ཐེ་ཙོམ་བྲལ།
en: There is no doubt that you have transcended the world

source: །འཇིག་རྟེན་དག་ཏུ་རྣམ་པར་འཕྲུལ་པ་མཛད།
en: And manifest miracles within the world.

source: །གཡོ་བ་མི་མངའ་སྐྱོན་བྲལ་ཆགས་པ་མེད།
en: “You are unshakable, without fault, without impediment.

source: །ཁྱོད་ཀྱིས་ཡེ་ཤེས་སྤྱན་ནི་རྣམ་སྦྱངས་པས།
en: You have purified your eyes of wisdom.

source: །རྡུལ་གྱི་གོ་ལ་ཐམས་ཅད་རྡུལ་ཚད་དུ།
en: You see in an atom as many buddhas

source: །སངས་རྒྱས་རྣམ་པར་འཕྲུལ་པ་མང་པོ་གཟིགས།
en: As there are atoms, performing miracles.

source: །ཁྱོད་ཀྱི་སྐུ་ནི་ཆོས་སྐུའི་སྙིང་པོ་ཅན།
en: “Your body has the essence of the Dharma body.

source: །ཁྱོད་ཀྱི་ཐུགས་ཀྱང་ཡེ་ཤེས་ཆགས་པ་མེད།
en: Your mind consists of unobstructed wisdom.

source: །ཁྱོད་ནི་ཀུན་ཏུ་འོད་ཀྱིས་སྣང་མཛད་པས།
en: You shine with the radiance of all-pervading light,

source: །འཇིག་རྟེན་སྐྱེ་བོ་རྣམས་ལ་མཐའ་ཡས་སྣང་།
en: Illuminating the endless beings in the world.

source: །སེམས་ལས་མཐའ་ཡས་ལས་རྣམས་ཡོངས་སུ་འབྱུང་།
en: “Endless karma arises from the mind.

source: །འཇིག་རྟེན་ཐམས་ཅད་ལས་ཀྱིས་རྣམ་པར་བྲིས།
en: All the worlds are paintings by karma.

source: །འགྲོ་བ་སེམས་ཀྱི་དངོས་སུ་མཁྱེན་གྱུར་པས།
en: You know directly the minds of beings,

source: །རང་གི་སྐུ་ཡང་འགྲོ་བ་སྙེད་དུ་བསྟན།
en: And the manifestations of your body are as numerous as beings.

source: །འཇིག་རྟེན་དུ་ནི་རྨི་ལམ་འདྲར་མཁྱེན་ནས།
en: “You know this world to be like a dream

source: །སངས་རྒྱས་ཀུན་ཀྱང་གཟུགས་བརྙན་ལྟ་བུ་དང་། །མ་ལུས་ཆོས་རྣམས་སྒྲ་བརྙན་འདྲར་མཁྱེན་པས།
en: And that all the buddhas are like reflections, That every single Dharma is like an echo,

source: །ཆགས་པ་མི་མངའ་འགྲོ་བ་ཀུན་དུ་སྤྱོད།
en: And without impediment you act within all worlds. “You manifest your body in each instant

source: །དུས་གསུམ་གནས་པའི་འགྲོ་བ་ཐམས་ཅད་ལ། །སྐད་ཅིག་རེ་རེ་རང་གི་སྐུ་སྟོན་ཀྱང་།
en: To all the beings dwelling in the three times.

source: །ཁྱོད་ཀྱི་ཐུགས་ལ་གཉིས་སུ་མི་རྒྱུ་སྟེ།
en: With no duality in your mind,

source: །ཕྱོགས་རྣམས་ཀུན་ཏུ་ཆོས་ཀྱང་རབ་ཏུ་བསྟན།
en: You teach the Dharma throughout all directions.

source: །རྡུལ་ལ་འགྲོ་བ་རྒྱ་མཚོ་མཐའ་ཡས་དང་། །དེ་བཞིན་སེམས་ཅན་མཚོ་ཆེན་དཔག་ཡས་དང་། །མཐའ་དབུས་མེད་པའི་བདེ་གཤེགས་གང་ཆེན་མཚོ།
en: “The ocean of atoms is without end, And the ocean of beings is also measureless. The ocean of the buddhas has no edge or center,

source: །ཀུན་ཀྱང་ཁྱོད་ཀྱི་རྣམ་ཐར་དམ་པའི་ཡུལ།
en: And they are all within the scope of your liberation.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་སྒྲ་རྒྱ་མཚོ་རབ་ཏུ་ཞི་བ་དང་ལྡན་པ་ལ། ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་མངོན་པར་བསྟོད་དེ། ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། མཚན་མོའི་ལྷ་མོ་སྒྲ་རྒྱ་མཚོ་རབ་ཏུ་ཞི་བ་དང་ལྡན་པའི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།
en: Sudhana, the head merchant’s son, having praised the night goddess Praśanta­ruta­sāgara­vatī with these appropriate verses, circumambulated the night goddess Praśanta­ruta­sāgara­vatī many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from the night goddess Praśanta­ruta­sāgara­vatī.

source: བམ་པོ་དགུ་པ།
en: Sarva­nagara­rakṣā­saṃbhava­tejaḥ­śrī

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་དགའ་བ་ཡངས་པའི་ཤུགས་འབྱུང་བས། སེམས་ཀྱི་སྐད་ཅིག་རྣམ་པར་བརྒྱན་པ་དེ་ནི་སྒོམ་པ་དང་། རྗེས་སུ་སྒོམ་པ་དང་། ཡང་དག་པར་སྒོམ་པ་དང་། མཚན་མོའི་ལྷ་མོའི་སྒྲ་རྒྱ་མཚོ་རབ་ཏུ་ཞི་བ་དང་ལྡན་པའི་གདམས་ངག་དང་། རྗེས་སུ་བསྟན་པ་ལ་ནི་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། ཁོང་དུ་ཆུད་པར་བྱེད།
en: Sudhana, the head merchant’s son, was meditating on, familiarizing himself with, and cultivating the bodhisattva liberation called the display in each instant of mind of the arising of the power of vast delight

source: ཚིག་དང་ཡི་གེ་རེ་རེ་ལ་ནི་ཚུལ་དུ་མ་དང་བསམ་པ་ཚད་མེད་པས་ཆོས་ཉིད་ཀྱི་ཚུལ་ཤེས་པ་རྗེས་སུ་དྲན་པར་བྱེད་ཅིང་དྲན་པས་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། བློ་གྲོས་ཀྱིས་རྣམ་པར་དབྱེ་བ་དང་། རིག་པས་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། བློས་ཤིན་ཏུ་ཡངས་པར་བྱ་བ་དང་། ལུས་ཀྱིས་རེག་པར་བྱས་ཏེ། རྣམ་པར་སྤྱད་པ་དང་། རྗེས་སུ་འཇུག་པར་བྱེད་ཅིང་། མཐར་གྱིས་མཚན་མོའི་ལྷ་མོ་གྲོང་ཁྱེར་ཐམས་ཅད་བསྲུང་བ་འབྱུང་བའི་གཟི་བརྗིད་དཔལ་གང་ན་བ་དེར་ཕྱིན་པ་དང་། མཚན་མོའི་ལྷ་མོ་གྲོང་ཁྱེར་ཐམས་ཅད་བསྲུང་བ་འབྱུང་བའི་གཟི་བརྗིད་དཔལ་པདྨོའི་ཁྲི་ཆེན་པོ།
en: He was following, remembering, and comprehending the instruction and teachings of the night goddess Praśanta­ruta­sāgara­vatī, remembering each word and letter, the numerous countless aspects, the knowledge of the aspects of the nature of phenomena, and he was relying on it through his memory, analyzing it with his intelligence, comprehending it with his understanding, increasing it with his intellect, feeling it with his body, practicing it, and engaging in it, and eventually he arrived where the night goddess Sarva­nagara­rakṣā­saṃbhava­tejaḥ­śrī was.

source: ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་གྲོང་ཁྱེར་དང་། གནས་ཐམས་ཅད་རབ་ཏུ་སྣང་བར་བྱེད་པའི་སྙིང་པོ་ཅན་ལ་ཕྱོགས་ཐམས་ཅད་དང་། འགྲོ་བ་ཐམས་ཅད་ལ་མངོན་དུ་གྱུར་པའི་ལུས་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་གཟུགས་དང་། མཉམ་པའི་ལུས་དང་སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་དུ་གྱུར་པའི་ལུས་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱིས་མ་གོས་པའི་ལུས་དང་། འགྲོ་བ་ཐམས་ཅད་དང་རང་བཞིན་མཉམ་པའི་ལུས་དང་། འགྲོ་བ་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པའི་ལུས་དང་། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བ་ལ་མཐུན་པའི་ལུས་དང་། འགྲོ་བ་ཐམས་ཅད་དུ་སྒྲ་རབ་ཏུ་སྒྲོགས་པའི་ལུས་དང་། འགྲོ་བ་ཐམས་ཅད་དུ་འཕོ་བ་མེད་པའི་ལུས་དང་། སྒྲིབ་པ་ཐམས་ཅད་ཤིན་ཏུ་བཅོམ་པའི་ལུས་དང་། དེ་བཞིན་ཉིད་ཀྱི་རང་བཞིན་གྱི་ལུས་དང་། འགྲོ་བ་ཐམས་ཅད་གདུལ་བར མཐར་ཕྱིན་པར་བྱེད་པའི་ལུས་སུ་འདུག་ཅིང་། མཚན་མོའི་ལྷ་མོ་བརྗོད་དུ་མེད་པའི་འཁོར་གྱིས་བསྐོར་ཏེ།
en: He saw the night goddess Sarva­nagara­rakṣā­saṃbhava­tejaḥ­śrī seated upon a great lotus throne containing the kings of precious jewels that illuminate towns and dwellings, with an entourage of countless night goddesses, with a body that appeared in all directions to all beings, with a body that had the forms of those of all beings, with a body that appeared before all beings, with a body that was unstained by all beings, with a body that had the same nature as that of all beings, with a body that was superior to those of all beings, with a body of the kind that could ripen and guide all beings, with a body through which she spoke to all beings, with a body that did not pass away among all beings, with a body that had vanquished all obscurations, with a body that had the nature of the ultimate nature of things, with a body that had reached the conclusion of guiding all beings.

source: འདུག་པ་མཐོང་ནས། དགའ་རངས་ཏེ་མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས།
en: When Sudhana saw her, he was filled with joy, delighted, elated, pleased, and happy.

source: མཚན་མོའི་ལྷ་མོ་གྲོང་ཁྱེར་ཐམས་ཅད་བསྲུང་བ་འབྱུང་བའི་གཟི་བརྗིད་དཔལ་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མཚན་མོའི་ལྷ་མོ་གྲོང་ཁྱེར་ཐམས་ཅད་བསྲུང་བ་འབྱུང་བའི་གཟི་བརྗིད་དཔལ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། མཚན་མོའི་ལྷ་མོ་གྲོང་ཁྱེར་ཐམས་ཅད་བསྲུང་བ་འབྱུང་བའི་གཟི་བརྗིད་དཔལ་གྱི་མདུན་དུ་འདུག་སྟེ།
en: He bowed his head to the night goddess Sarva­nagara­rakṣā­saṃbhava­tejaḥ­śrī’s feet, circumambulated the night goddess Sarva­nagara­rakṣā­saṃbhava­tejaḥ­śrī many hundreds of thousands of times, and then stood before the night goddess Sarva­nagara­rakṣā­saṃbhava­tejaḥ­śrī.
